library {
  function {
    signature {
      name: "__inference_activation_15_layer_call_fn_6711"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
    }
    node_def {
      name: "PartitionedCall"
      op: "PartitionedCall"
      input: "inputs"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_activation_15_layer_call_and_return_conditional_losses_6706"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "PartitionedCall"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "PartitionedCall:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_activation_12_layer_call_and_return_conditional_losses_3767"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
    }
    node_def {
      name: "Relu"
      op: "Relu"
      input: "inputs"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Relu"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "Relu:activations:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_sequential_4_layer_call_fn_4160"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "statefulpartitionedcall_args_1"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_2"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_3"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_4"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_5"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_6"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_7"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_8"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_9"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_10"
        type: DT_RESOURCE
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "StatefulPartitionedCall"
    }
    node_def {
      name: "StatefulPartitionedCall"
      op: "StatefulPartitionedCall"
      input: "inputs"
      input: "statefulpartitionedcall_args_1"
      input: "statefulpartitionedcall_args_2"
      input: "statefulpartitionedcall_args_3"
      input: "statefulpartitionedcall_args_4"
      input: "statefulpartitionedcall_args_5"
      input: "statefulpartitionedcall_args_6"
      input: "statefulpartitionedcall_args_7"
      input: "statefulpartitionedcall_args_8"
      input: "statefulpartitionedcall_args_9"
      input: "statefulpartitionedcall_args_10"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_sequential_4_layer_call_and_return_conditional_losses_4145"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "StatefulPartitionedCall"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "StatefulPartitionedCall:output:0"
      input: "^StatefulPartitionedCall"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    control_ret {
      key: "StatefulPartitionedCall"
      value: "StatefulPartitionedCall"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_sequential_4_layer_call_fn_7059"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "statefulpartitionedcall_args_1"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_2"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_3"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_4"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_5"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_6"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_7"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_8"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_9"
        type: DT_RESOURCE
      }
      input_arg {
        name: "statefulpartitionedcall_args_10"
        type: DT_RESOURCE
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "StatefulPartitionedCall"
    }
    node_def {
      name: "StatefulPartitionedCall"
      op: "StatefulPartitionedCall"
      input: "inputs"
      input: "statefulpartitionedcall_args_1"
      input: "statefulpartitionedcall_args_2"
      input: "statefulpartitionedcall_args_3"
      input: "statefulpartitionedcall_args_4"
      input: "statefulpartitionedcall_args_5"
      input: "statefulpartitionedcall_args_6"
      input: "statefulpartitionedcall_args_7"
      input: "statefulpartitionedcall_args_8"
      input: "statefulpartitionedcall_args_9"
      input: "statefulpartitionedcall_args_10"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_RESOURCE
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_sequential_4_layer_call_and_return_conditional_losses_7044"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "StatefulPartitionedCall"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "StatefulPartitionedCall:output:0"
      input: "^StatefulPartitionedCall"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    control_ret {
      key: "StatefulPartitionedCall"
      value: "StatefulPartitionedCall"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_sequential_4_layer_call_and_return_conditional_losses_6455"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "conv2d_10_conv2d_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "conv2d_10_biasadd_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "conv2d_11_conv2d_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "conv2d_11_biasadd_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "conv2d_12_conv2d_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "conv2d_12_biasadd_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "dense_5_matmul_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "dense_5_biasadd_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "dense_6_matmul_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "dense_6_biasadd_readvariableop_resource"
        type: DT_RESOURCE
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "conv2d_10/BiasAdd/ReadVariableOp"
      control_output: "conv2d_10/Conv2D/ReadVariableOp"
      control_output: "conv2d_11/BiasAdd/ReadVariableOp"
      control_output: "conv2d_11/Conv2D/ReadVariableOp"
      control_output: "conv2d_12/BiasAdd/ReadVariableOp"
      control_output: "conv2d_12/Conv2D/ReadVariableOp"
      control_output: "dense_5/BiasAdd/ReadVariableOp"
      control_output: "dense_5/MatMul/ReadVariableOp"
      control_output: "dense_6/BiasAdd/ReadVariableOp"
      control_output: "dense_6/MatMul/ReadVariableOp"
    }
    node_def {
      name: "conv2d_10/Conv2D/ReadVariableOp"
      op: "ReadVariableOp"
      input: "conv2d_10_conv2d_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_10/Conv2D/ReadVariableOp"
      }
    }
    node_def {
      name: "conv2d_10/Conv2D"
      op: "Conv2D"
      input: "inputs"
      input: "conv2d_10/Conv2D/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      attr {
        key: "dilations"
        value {
          list {
            i: 1
            i: 1
            i: 1
            i: 1
          }
        }
      }
      attr {
        key: "explicit_paddings"
        value {
          list {
          }
        }
      }
      attr {
        key: "padding"
        value {
          s: "VALID"
        }
      }
      attr {
        key: "strides"
        value {
          list {
            i: 1
            i: 1
            i: 1
            i: 1
          }
        }
      }
      attr {
        key: "use_cudnn_on_gpu"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_10/Conv2D"
      }
    }
    node_def {
      name: "conv2d_10/BiasAdd/ReadVariableOp"
      op: "ReadVariableOp"
      input: "conv2d_10_biasadd_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_10/BiasAdd/ReadVariableOp"
      }
    }
    node_def {
      name: "conv2d_10/BiasAdd"
      op: "BiasAdd"
      input: "conv2d_10/Conv2D:output:0"
      input: "conv2d_10/BiasAdd/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_10/BiasAdd"
      }
    }
    node_def {
      name: "activation_12/Relu"
      op: "Relu"
      input: "conv2d_10/BiasAdd:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "activation_12/Relu"
      }
    }
    node_def {
      name: "max_pooling2d_10/MaxPool"
      op: "MaxPool"
      input: "activation_12/Relu:activations:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      attr {
        key: "ksize"
        value {
          list {
            i: 1
            i: 2
            i: 2
            i: 1
          }
        }
      }
      attr {
        key: "padding"
        value {
          s: "VALID"
        }
      }
      attr {
        key: "strides"
        value {
          list {
            i: 1
            i: 2
            i: 2
            i: 1
          }
        }
      }
      experimental_debug_info {
        original_node_names: "max_pooling2d_10/MaxPool"
      }
    }
    node_def {
      name: "conv2d_11/Conv2D/ReadVariableOp"
      op: "ReadVariableOp"
      input: "conv2d_11_conv2d_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_11/Conv2D/ReadVariableOp"
      }
    }
    node_def {
      name: "conv2d_11/Conv2D"
      op: "Conv2D"
      input: "max_pooling2d_10/MaxPool:output:0"
      input: "conv2d_11/Conv2D/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      attr {
        key: "dilations"
        value {
          list {
            i: 1
            i: 1
            i: 1
            i: 1
          }
        }
      }
      attr {
        key: "explicit_paddings"
        value {
          list {
          }
        }
      }
      attr {
        key: "padding"
        value {
          s: "VALID"
        }
      }
      attr {
        key: "strides"
        value {
          list {
            i: 1
            i: 1
            i: 1
            i: 1
          }
        }
      }
      attr {
        key: "use_cudnn_on_gpu"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_11/Conv2D"
      }
    }
    node_def {
      name: "conv2d_11/BiasAdd/ReadVariableOp"
      op: "ReadVariableOp"
      input: "conv2d_11_biasadd_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_11/BiasAdd/ReadVariableOp"
      }
    }
    node_def {
      name: "conv2d_11/BiasAdd"
      op: "BiasAdd"
      input: "conv2d_11/Conv2D:output:0"
      input: "conv2d_11/BiasAdd/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_11/BiasAdd"
      }
    }
    node_def {
      name: "activation_13/Relu"
      op: "Relu"
      input: "conv2d_11/BiasAdd:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "activation_13/Relu"
      }
    }
    node_def {
      name: "max_pooling2d_11/MaxPool"
      op: "MaxPool"
      input: "activation_13/Relu:activations:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      attr {
        key: "ksize"
        value {
          list {
            i: 1
            i: 2
            i: 2
            i: 1
          }
        }
      }
      attr {
        key: "padding"
        value {
          s: "VALID"
        }
      }
      attr {
        key: "strides"
        value {
          list {
            i: 1
            i: 2
            i: 2
            i: 1
          }
        }
      }
      experimental_debug_info {
        original_node_names: "max_pooling2d_11/MaxPool"
      }
    }
    node_def {
      name: "conv2d_12/Conv2D/ReadVariableOp"
      op: "ReadVariableOp"
      input: "conv2d_12_conv2d_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_12/Conv2D/ReadVariableOp"
      }
    }
    node_def {
      name: "conv2d_12/Conv2D"
      op: "Conv2D"
      input: "max_pooling2d_11/MaxPool:output:0"
      input: "conv2d_12/Conv2D/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      attr {
        key: "dilations"
        value {
          list {
            i: 1
            i: 1
            i: 1
            i: 1
          }
        }
      }
      attr {
        key: "explicit_paddings"
        value {
          list {
          }
        }
      }
      attr {
        key: "padding"
        value {
          s: "VALID"
        }
      }
      attr {
        key: "strides"
        value {
          list {
            i: 1
            i: 1
            i: 1
            i: 1
          }
        }
      }
      attr {
        key: "use_cudnn_on_gpu"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_12/Conv2D"
      }
    }
    node_def {
      name: "conv2d_12/BiasAdd/ReadVariableOp"
      op: "ReadVariableOp"
      input: "conv2d_12_biasadd_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_12/BiasAdd/ReadVariableOp"
      }
    }
    node_def {
      name: "conv2d_12/BiasAdd"
      op: "BiasAdd"
      input: "conv2d_12/Conv2D:output:0"
      input: "conv2d_12/BiasAdd/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_12/BiasAdd"
      }
    }
    node_def {
      name: "activation_14/Relu"
      op: "Relu"
      input: "conv2d_12/BiasAdd:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "activation_14/Relu"
      }
    }
    node_def {
      name: "max_pooling2d_12/MaxPool"
      op: "MaxPool"
      input: "activation_14/Relu:activations:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      attr {
        key: "ksize"
        value {
          list {
            i: 1
            i: 2
            i: 2
            i: 1
          }
        }
      }
      attr {
        key: "padding"
        value {
          s: "VALID"
        }
      }
      attr {
        key: "strides"
        value {
          list {
            i: 1
            i: 2
            i: 2
            i: 1
          }
        }
      }
      experimental_debug_info {
        original_node_names: "max_pooling2d_12/MaxPool"
      }
    }
    node_def {
      name: "flatten_4/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\377\377\377\377@*\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "flatten_4/Const"
      }
    }
    node_def {
      name: "flatten_4/Reshape"
      op: "Reshape"
      input: "max_pooling2d_12/MaxPool:output:0"
      input: "flatten_4/Const:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
      experimental_debug_info {
        original_node_names: "flatten_4/Reshape"
      }
    }
    node_def {
      name: "dense_5/MatMul/ReadVariableOp"
      op: "ReadVariableOp"
      input: "dense_5_matmul_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "dense_5/MatMul/ReadVariableOp"
      }
    }
    node_def {
      name: "dense_5/MatMul"
      op: "MatMul"
      input: "flatten_4/Reshape:output:0"
      input: "dense_5/MatMul/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "transpose_a"
        value {
          b: false
        }
      }
      attr {
        key: "transpose_b"
        value {
          b: false
        }
      }
      experimental_debug_info {
        original_node_names: "dense_5/MatMul"
      }
    }
    node_def {
      name: "dense_5/BiasAdd/ReadVariableOp"
      op: "ReadVariableOp"
      input: "dense_5_biasadd_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "dense_5/BiasAdd/ReadVariableOp"
      }
    }
    node_def {
      name: "dense_5/BiasAdd"
      op: "BiasAdd"
      input: "dense_5/MatMul:product:0"
      input: "dense_5/BiasAdd/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      experimental_debug_info {
        original_node_names: "dense_5/BiasAdd"
      }
    }
    node_def {
      name: "activation_15/Relu"
      op: "Relu"
      input: "dense_5/BiasAdd:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "activation_15/Relu"
      }
    }
    node_def {
      name: "dropout_6/Identity"
      op: "Identity"
      input: "activation_15/Relu:activations:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "dropout_6/Identity"
      }
    }
    node_def {
      name: "dense_6/MatMul/ReadVariableOp"
      op: "ReadVariableOp"
      input: "dense_6_matmul_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "dense_6/MatMul/ReadVariableOp"
      }
    }
    node_def {
      name: "dense_6/MatMul"
      op: "MatMul"
      input: "dropout_6/Identity:output:0"
      input: "dense_6/MatMul/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "transpose_a"
        value {
          b: false
        }
      }
      attr {
        key: "transpose_b"
        value {
          b: false
        }
      }
      experimental_debug_info {
        original_node_names: "dense_6/MatMul"
      }
    }
    node_def {
      name: "dense_6/BiasAdd/ReadVariableOp"
      op: "ReadVariableOp"
      input: "dense_6_biasadd_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "dense_6/BiasAdd/ReadVariableOp"
      }
    }
    node_def {
      name: "dense_6/BiasAdd"
      op: "BiasAdd"
      input: "dense_6/MatMul:product:0"
      input: "dense_6/BiasAdd/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      experimental_debug_info {
        original_node_names: "dense_6/BiasAdd"
      }
    }
    node_def {
      name: "activation_16/Sigmoid"
      op: "Sigmoid"
      input: "dense_6/BiasAdd:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "activation_16/Sigmoid"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "activation_16/Sigmoid:y:0"
      input: "^conv2d_10/BiasAdd/ReadVariableOp"
      input: "^conv2d_10/Conv2D/ReadVariableOp"
      input: "^conv2d_11/BiasAdd/ReadVariableOp"
      input: "^conv2d_11/Conv2D/ReadVariableOp"
      input: "^conv2d_12/BiasAdd/ReadVariableOp"
      input: "^conv2d_12/Conv2D/ReadVariableOp"
      input: "^dense_5/BiasAdd/ReadVariableOp"
      input: "^dense_5/MatMul/ReadVariableOp"
      input: "^dense_6/BiasAdd/ReadVariableOp"
      input: "^dense_6/MatMul/ReadVariableOp"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    control_ret {
      key: "conv2d_10/BiasAdd/ReadVariableOp"
      value: "conv2d_10/BiasAdd/ReadVariableOp"
    }
    control_ret {
      key: "conv2d_10/Conv2D/ReadVariableOp"
      value: "conv2d_10/Conv2D/ReadVariableOp"
    }
    control_ret {
      key: "conv2d_11/BiasAdd/ReadVariableOp"
      value: "conv2d_11/BiasAdd/ReadVariableOp"
    }
    control_ret {
      key: "conv2d_11/Conv2D/ReadVariableOp"
      value: "conv2d_11/Conv2D/ReadVariableOp"
    }
    control_ret {
      key: "conv2d_12/BiasAdd/ReadVariableOp"
      value: "conv2d_12/BiasAdd/ReadVariableOp"
    }
    control_ret {
      key: "conv2d_12/Conv2D/ReadVariableOp"
      value: "conv2d_12/Conv2D/ReadVariableOp"
    }
    control_ret {
      key: "dense_5/BiasAdd/ReadVariableOp"
      value: "dense_5/BiasAdd/ReadVariableOp"
    }
    control_ret {
      key: "dense_5/MatMul/ReadVariableOp"
      value: "dense_5/MatMul/ReadVariableOp"
    }
    control_ret {
      key: "dense_6/BiasAdd/ReadVariableOp"
      value: "dense_6/BiasAdd/ReadVariableOp"
    }
    control_ret {
      key: "dense_6/MatMul/ReadVariableOp"
      value: "dense_6/MatMul/ReadVariableOp"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_dropout_6_layer_call_fn_6674"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
    }
    node_def {
      name: "PartitionedCall"
      op: "PartitionedCall"
      input: "inputs"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_dropout_6_layer_call_and_return_conditional_losses_6669"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "PartitionedCall"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "PartitionedCall:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_activation_15_layer_call_and_return_conditional_losses_3663"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
    }
    node_def {
      name: "Relu"
      op: "Relu"
      input: "inputs"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Relu"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "Relu:activations:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_activation_14_layer_call_fn_6531"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
    }
    node_def {
      name: "PartitionedCall"
      op: "PartitionedCall"
      input: "inputs"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_activation_14_layer_call_and_return_conditional_losses_6526"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "PartitionedCall"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "PartitionedCall:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_conv2d_12_layer_call_and_return_conditional_losses_3467"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "conv2d_readvariableop_resource"
        type: DT_RESOURCE
      }
      input_arg {
        name: "biasadd_readvariableop_resource"
        type: DT_RESOURCE
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "BiasAdd/ReadVariableOp"
      control_output: "Conv2D/ReadVariableOp"
    }
    node_def {
      name: "dilation_rate"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\001\000\000\000\001\000\000\000"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "dilation_rate"
      }
    }
    node_def {
      name: "Conv2D/ReadVariableOp"
      op: "ReadVariableOp"
      input: "conv2d_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Conv2D/ReadVariableOp"
      }
    }
    node_def {
      name: "Conv2D"
      op: "Conv2D"
      input: "inputs"
      input: "Conv2D/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      attr {
        key: "dilations"
        value {
          list {
            i: 1
            i: 1
            i: 1
            i: 1
          }
        }
      }
      attr {
        key: "explicit_paddings"
        value {
          list {
          }
        }
      }
      attr {
        key: "padding"
        value {
          s: "VALID"
        }
      }
      attr {
        key: "strides"
        value {
          list {
            i: 1
            i: 1
            i: 1
            i: 1
          }
        }
      }
      attr {
        key: "use_cudnn_on_gpu"
        value {
          b: true
        }
      }
      experimental_debug_info {
        original_node_names: "Conv2D"
      }
    }
    node_def {
      name: "BiasAdd/ReadVariableOp"
      op: "ReadVariableOp"
      input: "biasadd_readvariableop_resource"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "BiasAdd/ReadVariableOp"
      }
    }
    node_def {
      name: "BiasAdd"
      op: "BiasAdd"
      input: "Conv2D:output:0"
      input: "BiasAdd/ReadVariableOp:value:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "data_format"
        value {
          s: "NHWC"
        }
      }
      experimental_debug_info {
        original_node_names: "BiasAdd"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "BiasAdd:output:0"
      input: "^BiasAdd/ReadVariableOp"
      input: "^Conv2D/ReadVariableOp"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    control_ret {
      key: "BiasAdd/ReadVariableOp"
      value: "BiasAdd/ReadVariableOp"
    }
    control_ret {
      key: "Conv2D/ReadVariableOp"
      value: "Conv2D/ReadVariableOp"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_activation_16_layer_call_and_return_conditional_losses_3907"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
    }
    node_def {
      name: "Sigmoid"
      op: "Sigmoid"
      input: "inputs"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Sigmoid"
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "Sigmoid:y:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      experimental_debug_info {
        original_node_names: "Identity"
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "inputs"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_sequential_4_layer_call_and_return_conditional_losses_6985"
      input_arg {
        name: "inputs"
        type: DT_FLOAT
      }
      input_arg {
        name: "conv2d_10_statefulpartitionedcall_args_1"
        type: DT_RESOURCE
      }
      input_arg {
        name: "conv2d_10_statefulpartitionedcall_args_2"
        type: DT_RESOURCE
      }
      input_arg {
        name: "conv2d_11_statefulpartitionedcall_args_1"
        type: DT_RESOURCE
      }
      input_arg {
        name: "conv2d_11_statefulpartitionedcall_args_2"
        type: DT_RESOURCE
      }
      input_arg {
        name: "conv2d_12_statefulpartitionedcall_args_1"
        type: DT_RESOURCE
      }
      input_arg {
        name: "conv2d_12_statefulpartitionedcall_args_2"
        type: DT_RESOURCE
      }
      input_arg {
        name: "dense_5_statefulpartitionedcall_args_1"
        type: DT_RESOURCE
      }
      input_arg {
        name: "dense_5_statefulpartitionedcall_args_2"
        type: DT_RESOURCE
      }
      input_arg {
        name: "dense_6_statefulpartitionedcall_args_1"
        type: DT_RESOURCE
      }
      input_arg {
        name: "dense_6_statefulpartitionedcall_args_2"
        type: DT_RESOURCE
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "conv2d_10/StatefulPartitionedCall"
      control_output: "conv2d_11/StatefulPartitionedCall"
      control_output: "conv2d_12/StatefulPartitionedCall"
      control_output: "dense_5/StatefulPartitionedCall"
      control_output: "dense_6/StatefulPartitionedCall"
    }
    node_def {
      name: "conv2d_10/StatefulPartitionedCall"
      op: "StatefulPartitionedCall"
      input: "inputs"
      input: "conv2d_10_statefulpartitionedcall_args_1"
      input: "conv2d_10_statefulpartitionedcall_args_2"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
            type: DT_RESOURCE
            type: DT_RESOURCE
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_conv2d_10_layer_call_and_return_conditional_losses_6876"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_10/StatefulPartitionedCall"
      }
    }
    node_def {
      name: "activation_12/PartitionedCall"
      op: "PartitionedCall"
      input: "conv2d_10/StatefulPartitionedCall:output:0"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_activation_12_layer_call_and_return_conditional_losses_6634"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "activation_12/PartitionedCall"
      }
    }
    node_def {
      name: "max_pooling2d_10/PartitionedCall"
      op: "PartitionedCall"
      input: "activation_12/PartitionedCall:output:0"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_max_pooling2d_10_layer_call_and_return_conditional_losses_6893"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "max_pooling2d_10/PartitionedCall"
      }
    }
    node_def {
      name: "conv2d_11/StatefulPartitionedCall"
      op: "StatefulPartitionedCall"
      input: "max_pooling2d_10/PartitionedCall:output:0"
      input: "conv2d_11_statefulpartitionedcall_args_1"
      input: "conv2d_11_statefulpartitionedcall_args_2"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
            type: DT_RESOURCE
            type: DT_RESOURCE
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_conv2d_11_layer_call_and_return_conditional_losses_6793"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_11/StatefulPartitionedCall"
      }
    }
    node_def {
      name: "activation_13/PartitionedCall"
      op: "PartitionedCall"
      input: "conv2d_11/StatefulPartitionedCall:output:0"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_activation_13_layer_call_and_return_conditional_losses_6378"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "activation_13/PartitionedCall"
      }
    }
    node_def {
      name: "max_pooling2d_11/PartitionedCall"
      op: "PartitionedCall"
      input: "activation_13/PartitionedCall:output:0"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_max_pooling2d_11_layer_call_and_return_conditional_losses_6696"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "max_pooling2d_11/PartitionedCall"
      }
    }
    node_def {
      name: "conv2d_12/StatefulPartitionedCall"
      op: "StatefulPartitionedCall"
      input: "max_pooling2d_11/PartitionedCall:output:0"
      input: "conv2d_12_statefulpartitionedcall_args_1"
      input: "conv2d_12_statefulpartitionedcall_args_2"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
            type: DT_RESOURCE
            type: DT_RESOURCE
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0012\005*\0010J\0008\001"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_conv2d_12_layer_call_and_return_conditional_losses_6366"
          }
        }
      }
      experimental_debug_info {
        original_node_names: "conv2d_12/StatefulPartitionedCall"
      }
    }
    node_def {
      name: "activation_14/PartitionedCall"
      op: "PartitionedCall"
      input: "conv2d_12/StatefulPartitionedCall:output:0"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_gradient_op_type"
        value {
          s: "PartitionedCallUnused"
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
